In [2]:
import numpy as np
import pandas as pd

In [3]:
df=pd.DataFrame({'col1':[1,2,3,np.nan,5,6],'col2':[11,12,None,None,100,20]})
df

   col1   col2
0   1.0   11.0
1   2.0   12.0
2   3.0    NaN
3   NaN    NaN
4   5.0  100.0
5   6.0   20.0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      float64
 1   col2    4 non-null      float64
dtypes: float64(2)
memory usage: 228.0 bytes

## isna() -> is a build-in method used to get null values from a dataset
    Syntax:
        df.isna() / df.isnull()
    -> returns boolean values
    -> returns True if the values are NaN else False

In [6]:
df.isna()

    col1   col2
0  False  False
1  False  False
2  False   True
3   True   True
4  False  False
5  False  False

In [9]:
df.isna().sum()

col1    1
col2    2
dtype: int64

In [10]:
df.isnull()

    col1   col2
0  False  False
1  False  False
2  False   True
3   True   True
4  False  False
5  False  False

## dropna() -> it is a build-in method which is uesd to remove rows if it is having NaN(null value)
    -> if any column is having NaN it removes/deletes entire row by default
syntax:
    df.dropna()
    df.dropna(subset=[column1,column2,.....])
    df.dropna(subset=[column1,column2,.....],how='all')

In [12]:
df

   col1   col2
0   1.0   11.0
1   2.0   12.0
2   3.0    NaN
3   NaN    NaN
4   5.0  100.0
5   6.0   20.0

In [11]:
df.dropna()

   col1   col2
0   1.0   11.0
1   2.0   12.0
4   5.0  100.0
5   6.0   20.0

In [15]:
df.dropna(subset=['col1']) # returns new dataframe

   col1   col2
0   1.0   11.0
1   2.0   12.0
2   3.0    NaN
4   5.0  100.0
5   6.0   20.0

In [16]:
df=df.dropna(subset=['col1'])
df

   col1   col2
0   1.0   11.0
1   2.0   12.0
2   3.0    NaN
4   5.0  100.0
5   6.0   20.0

## how to update the dropna records by default
- df.dropna(inplace=True)

In [17]:
df=pd.DataFrame({'col1':[1,2,3,np.nan,5,6],'col2':[11,12,None,None,100,20]})
df.dropna(inplace=True)
df

   col1   col2
0   1.0   11.0
1   2.0   12.0
4   5.0  100.0
5   6.0   20.0

In [21]:
df=pd.DataFrame({'col1':[1,2,3,np.nan,5,6],'col2':[11,12,None,None,100,20]})
df.dropna(subset=['col1','col2'],how='all')

   col1   col2
0   1.0   11.0
1   2.0   12.0
2   3.0    NaN
4   5.0  100.0
5   6.0   20.0

In [26]:
df=pd.read_csv('tested.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [28]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200